## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/32a7915e-6e93-4e2b-a16f-dfcc91f56577/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.acr_pull will be created
  + resource "azurerm_role_assignment" "acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/001a4eb4-4cb2-47b9-a3bd-de9b5304872c/resourceGroups/2048-game-prod-uksouth-rg/providers/Microsoft.ContainerRegistry/registries/2048gamecontainerregistry"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aksprod"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "uksouth"
      + name                                = "AKScluster"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "2048-game-prod-uksouth-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "prod"
        }
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_role_assignment.network_contributor will be created
  + resource "azurerm_role_assignment" "network_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/001a4eb4-4cb2-47b9-a3bd-de9b5304872c/resourceGroups/2048-game-prod-uksouth-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.aks_managed_identity will be created
  + resource "azurerm_user_assigned_identity" "aks_managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks-managed-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "2048-game-prod-uksouth-rg"
      + tenant_id           = (known after apply)
    }

  # module.vnet.azurerm_subnet.main will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.1.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "Subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "2048-game-prod-uksouth-rg"
      + virtual_network_name                          = "Vnet"
    }

  # module.vnet.azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.1.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "Vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "2048-game-prod-uksouth-rg"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "prod"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_role_assignment.acr_pull will be created%0A  + resource "azurerm_role_assignment" "acr_pull" {%0A      + condition_version                = (known after apply)%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "AcrPull"%0A      + scope                            = "/subscriptions/001a4eb4-4cb2-47b9-a3bd-de9b5304872c/resourceGroups/2048-game-prod-uksouth-rg/providers/Microsoft.ContainerRegistry/registries/2048gamecontainerregistry"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be created%0A  + resource "azurerm_kubernetes_cluster" "aks" {%0A      + current_kubernetes_version          = (known after apply)%0A      + dns_prefix                          = "aksprod"%0A      + fqdn                                = (known after apply)%0A      + http_application_routing_zone_name  = (known after apply)%0A      + id                                  = (known after apply)%0A      + kube_admin_config                   = (sensitive value)%0A      + kube_admin_config_raw               = (sensitive value)%0A      + kube_config                         = (sensitive value)%0A      + kube_config_raw                     = (sensitive value)%0A      + kubernetes_version                  = (known after apply)%0A      + location                            = "uksouth"%0A      + name                                = "AKScluster"%0A      + node_os_upgrade_channel             = "NodeImage"%0A      + node_resource_group                 = (known after apply)%0A      + node_resource_group_id              = (known after apply)%0A      + oidc_issuer_enabled                 = true%0A      + oidc_issuer_url                     = (known after apply)%0A      + portal_fqdn                         = (known after apply)%0A      + private_cluster_enabled             = false%0A      + private_cluster_public_fqdn_enabled = false%0A      + private_dns_zone_id                 = (known after apply)%0A      + private_fqdn                        = (known after apply)%0A      + resource_group_name                 = "2048-game-prod-uksouth-rg"%0A      + role_based_access_control_enabled   = true%0A      + run_command_enabled                 = true%0A      + sku_tier                            = "Free"%0A      + support_plan                        = "KubernetesOfficial"%0A      + tags                                = {%0A          + "environment" = "prod"%0A        }%0A      + workload_identity_enabled           = true%0A%0A      + auto_scaler_profile (known after apply)%0A%0A      + default_node_pool {%0A          + kubelet_disk_type    = (known after apply)%0A          + max_pods             = (known after apply)%0A          + name                 = "default"%0A          + node_count           = 2%0A          + node_labels          = (known after apply)%0A          + orchestrator_version = (known after apply)%0A          + os_disk_size_gb      = (known after apply)%0A          + os_disk_type         = "Managed"%0A          + os_sku               = (known after apply)%0A          + scale_down_mode      = "Delete"%0A          + type                 = "VirtualMachineScaleSets"%0A          + ultra_ssd_enabled    = false%0A          + vm_size              = "Standard_DS2_v2"%0A          + vnet_subnet_id       = (known after apply)%0A          + workload_runtime     = (known after apply)%0A        }%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + kubelet_identity (known after apply)%0A%0A      + network_profile (known after apply)%0A%0A      + windows_profile (known after apply)%0A    }%0A%0A  # module.aks.azurerm_role_assignment.network_contributor will be created%0A  + resource "azurerm_role_assignment" "network_contributor" {%0A      + condition_version                = (known after apply)%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Network Contributor"%0A      + scope                            = "/subscriptions/001a4eb4-4cb2-47b9-a3bd-de9b5304872c/resourceGroups/2048-game-prod-uksouth-rg"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.aks.azurerm_user_assigned_identity.aks_managed_identity will be created%0A  + resource "azurerm_user_assigned_identity" "aks_managed_identity" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "uksouth"%0A      + name                = "aks-managed-identity"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "2048-game-prod-uksouth-rg"%0A      + tenant_id           = (known after apply)%0A    }%0A%0A  # module.vnet.azurerm_subnet.main will be created%0A  + resource "azurerm_subnet" "main" {%0A      + address_prefixes                              = [%0A          + "10.1.1.0/24",%0A        ]%0A      + default_outbound_access_enabled               = true%0A      + id                                            = (known after apply)%0A      + name                                          = "Subnet"%0A      + private_endpoint_network_policies             = "Disabled"%0A      + private_link_service_network_policies_enabled = true%0A      + resource_group_name                           = "2048-game-prod-uksouth-rg"%0A      + virtual_network_name                          = "Vnet"%0A    }%0A%0A  # module.vnet.azurerm_virtual_network.main will be created%0A  + resource "azurerm_virtual_network" "main" {%0A      + address_space                  = [%0A          + "10.1.0.0/16",%0A        ]%0A      + dns_servers                    = (known after apply)%0A      + guid                           = (known after apply)%0A      + id                             = (known after apply)%0A      + location                       = "uksouth"%0A      + name                           = "Vnet"%0A      + private_endpoint_vnet_policies = "Disabled"%0A      + resource_group_name            = "2048-game-prod-uksouth-rg"%0A      + subnet                         = (known after apply)%0A      + tags                           = {%0A          + "environment" = "prod"%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>